(function () {
  "use strict";

	/**
	* @param {string} fy (会計)年度
	*/
	async function fetchLatestSeqNum(fy) {
		// -------------------------------------------------------------------------- //
		// 外部公開APIのURL (クエリー条件は固定)
		// -------------------------------------------------------------------------- //
		const url = "https://wwxxyyzz.viewer.kintoneapp.com/public/api/....";

		const response = await fetch(url, {
			method: "GET",
			headers: {
				"Content-Type": "application/json",
			},
		});

		if (!response.ok) {
			throw new Error("外部公開APIの呼び出し失敗");
		}

		const queryData = await response.json();
		// -------------------------------------------------------------------------- //
		// 1. 年度が一致するレコードだけ抽出
		// -------------------------------------------------------------------------- //
		const fyFilteredData = queryData.records.filter((rec) => {
			return String(rec["fiscalYear"].value) === String(fy); // フィールドコードはfiscalYearと設定されているものとする
		});
		// -------------------------------------------------------------------------- //
		// 2. 年度内の通し番号を求める
		// ここで, 年度内の通し番号のフィールドコードは seqNumByFiscalYear と設定されているものとする
		// -------------------------------------------------------------------------- //
		if (0 < fyFilteredData.length) {
			const latestSeqNum = Math.max(
				...fyFilteredData.map((rec) => parseInt(rec["seqNumByFiscalYear"].value, 10))
			);
			return latestSeqNum;
		} else {
			return 0; // 対象年度のレコードが存在しない場合
		}
	}

// -------------------------------------------------------------------------- //
// 回答画面で回答ボタンをクリックしたときのイベントハンドラ
// see https://form.kintoneapp.com/help/customize/v2
// -------------------------------------------------------------------------- //
	formBridge.events.on("form.submit", async function (context) {
		// -------------------------------------------------------------------------- //
		//
		// -------------------------------------------------------------------------- //
		const record = formBridge.fn.getRecord();
		// -------------------------------------------------------------------------- //
		// 
		// -------------------------------------------------------------------------- //
		const currentUniqSeqNum = record.uniqueSeqNum.value; // FormBridge上のレコードの中の受付番号を取得
		if (!currentUniqSeqNum) {
			// -------------------------------------------------------------------------- //
			// レコード追加を想定すると, 受付番号は採番されていない状態のはずのため, 
			// ここに分岐することが期待される.
			//
			// なお, この条件分岐を記述せずに, 後続のformBridge.fn.emitSubmit() を呼び出そうとする場合の挙動については, 各自確認されたい.
			//
			// 通常の回答データ送信処理をキャンセル
			// -------------------------------------------------------------------------- //
			context.preventDefault();

			const fy = .... // To do ここで, 申請日時等から(会計)年度を算出する

			// -------------------------------------------------------------------------- //
			// 年度内の通し番号の最新値を取得
			// -------------------------------------------------------------------------- //
			const latestFyFileredSeqNum = await fetchLatestSeqNum(fy);
			// -------------------------------------------------------------------------- //
			// 年度内の通し番号の次の値を 最新値に+1して計算
			// -------------------------------------------------------------------------- //
			const nextFySeqNum = latestFyFileredSeqNum + 1;
			// -------------------------------------------------------------------------- //
			// (kintone上, 重複しない値に設定されている) 受付番号の次の値を合成する
			// -------------------------------------------------------------------------- //
			const nextUniqSeqNum = .... // To do ここで, fy と nextFySeqNum とを使って, 受付番号を合成
			// -------------------------------------------------------------------------- //
			// 取得したデータをセット
			// -------------------------------------------------------------------------- //
			context.setFieldValue("fiscalYear", String(fy)); // 年度を設定
			context.setFieldValue("seqNumByFiscalYear", String(nextFySeqNum)); // 年度内の通し番号
			context.setFieldValue("uniqueSeqNum", nextUniqSeqNum); // 受付番号 (kintone上, 重複しない値に設定されている)
			// -------------------------------------------------------------------------- //
			// 回答データの送信
			// -------------------------------------------------------------------------- //
			formBridge.fn.emitSubmit();
			// -------------------------------------------------------------------------- //
			// 
			// -------------------------------------------------------------------------- //
		}
		
	});

})();